using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using TestingForEmployees.Models;
using TestingForEmployees.Models.Entities;
using Microsoft.AspNetCore.Builder;
using Microsoft.Extensions.DependencyInjection;
using Microsoft.AspNetCore.Identity;
using Microsoft.EntityFrameworkCore;
using Microsoft.AspNetCore.Identity.EntityFrameworkCore;



namespace TestingForEmployees.Data
{
    public  class DataBaseInitilize
    {
        public static void InitilizeBranch(IServiceProvider serviceProvider)
        {
            var context = serviceProvider.GetService<DataContext>();

            collection.Add("/331467/", "Полтавське обласне управління");
            collection.Add("/331467/000000/", "000 ПОЛТАВА вул. Жовтнева 63-А");
            collection.Add("/331467/000001/", "ТВБВ №10016/01 МАШІВКА вул. Леніна  134");
            collection.Add("/331467/000001/060001/", "ТВБВ №10016/01 ОПЧ МАШІВКА вул. Леніна  134");
            collection.Add("/331467/000007/", "ТВБВ №10016/07 ЧУТОВЕ вул. Леніна  3");
            collection.Add("/331467/000007/060007/", "ТВБВ №10016/07 ОПЧ ЧУТОВЕ вул. Леніна  3");
            collection.Add("/331467/000015/", "ТВБВ №10016/015 ПОЛТАВА вул. Червоноармійська  5");
            collection.Add("/331467/000015/060015/", "ТВБВ №10016/015 ОПЧ ПОЛТАВА вул. Червоноармійська  5");
            collection.Add("/331467/000016/", "ТВБВ №10016/016 СЕМЕНІВКА вул. Леніна  44-а");
            collection.Add("/331467/000016/060016/", "ТВБВ №10016/016 ОПЧ СЕМЕНІВКА вул. Леніна  44-а");
            collection.Add("/331467/000022/", "ТВБВ №10016/022 ХОРОЛ вул. Леніна  94");
            collection.Add("/331467/000022/060022/", "ТВБВ №10016/022 ОПЧ ХОРОЛ вул. Леніна  94");
            collection.Add("/331467/000031/", "ТВБВ №10016/031 КАРЛІВКА вул. 60-річчя Жовтня  8/2");
            collection.Add("/331467/000031/000006/", "ТВБВ №10016/06 РЯСЬКЕ вул. Шевченка  62");
            collection.Add("/331467/000031/000008/", "ТВБВ №10016/08 АРТЕМІВКА вул. Миру  3");
            collection.Add("/331467/000031/060031/", "ТВБВ №10016/031 ОПЧ КАРЛІВКА вул. 60-річчя Жовтня  8/2");
            collection.Add("/331467/000037/", "ТВБВ №10016/037 ВЕЛИКА БАГАЧКА вул. Шевченка  71");
            collection.Add("/331467/000037/060037/", "ТВБВ №10016/037 ОПЧ ВЕЛИКА БАГАЧКА вул. Шевченка  71");
            collection.Add("/331467/000045/", "ТВБВ №10016/045 ДИКАНЬКА вул. Пушкіна  11-а");
            collection.Add("/331467/000045/060045/", "ТВБВ №10016/045 ОПЧ ДИКАНЬКА вул. Пушкіна  11-а");
            collection.Add("/331467/000053/", "ТВБВ №10016/053 РЕШЕТИЛІВКА вул. Жовтнева  20");
            collection.Add("/331467/000053/060053/", "ТВБВ №10016/053 ОПЧ РЕШЕТИЛІВКА вул. Жовтнева  20");
            collection.Add("/331467/000060/", "ТВБВ №10016/060 ГРЕБІНКА вул. Жовтнева  3");
            collection.Add("/331467/000060/060060/", "ТВБВ №10016/060 ОПЧ ГРЕБІНКА вул. Жовтнева  3");
            collection.Add("/331467/000068/", "ТВБВ №10016/068 КОМСОМОЛЬСЬК вул. Леніна  54");
            collection.Add("/331467/000068/060068/", "ТВБВ №10016/068 ОПЧ КОМСОМОЛЬСЬК вул. Леніна  54");
            collection.Add("/331467/000069/", "ТВБВ №10016/069 ГОРІШНІ ПЛАВНІ вул. Героїв Дніпра  37");
            collection.Add("/331467/000069/060069/", "ТВБВ №10016/069 ОПЧ ГОРІШНІ ПЛАВНІ вул. Героїв Дніпра  37");
            collection.Add("/331467/000070/", "ТВБВ №10016/070 ПОЛТАВА вул. Жовтнева 63-А");
            collection.Add("/331467/000070/060070/", "ТВБВ №10016/070 ОПЧ ПОЛТАВА вул. Жовтнева 63-А");
            collection.Add("/331467/000072/", "ТВБВ №10016/072 КОБЕЛЯКИ вул. Шевченка 4");
            collection.Add("/331467/000072/060072/", "ТВБВ №10016/072 ОПЧ КОБЕЛЯКИ вул. Шевченка 4");
            collection.Add("/331467/000079/", "ТВБВ №10016/079 ПИРЯТИН вул. Леніна  45");
            collection.Add("/331467/000079/060079/", "ТВБВ №10016/079 ОПЧ ПИРЯТИН вул. Леніна  45");
            collection.Add("/331467/000084/", "ТВБВ №10016/084 КОТЕЛЬВА вул. Жовтнева 219");
            collection.Add("/331467/000084/060084/", "ТВБВ №10016/084 ОПЧ КОТЕЛЬВА вул. Жовтнева 219");
            collection.Add("/331467/000089/", "ТВБВ №10016/089 ГЛОБИНЕ вул. Леніна 210");
            collection.Add("/331467/000089/000094/", "ТВБВ №10016/094 ВЕЛИКІ КРИНКИ вул. Леніна 8");
            collection.Add("/331467/000089/000098/", "ТВБВ №10016/098 ГРАДИЗЬК вул. Героїв Дніпра 2");
            collection.Add("/331467/000089/060089/", "ТВБВ №10016/089 ОПЧ ГЛОБИНЕ вул. Леніна 210");
            collection.Add("/331467/000101/", "ТВБВ №10016/0101 ЗІНЬКІВ вул. Леніна 63");
            collection.Add("/331467/000101/060101/", "ТВБВ №10016/0101 ОПЧ ЗІНЬКІВ вул. Леніна 63");
            collection.Add("/331467/000112/", "ТВБВ №10016/0112 ПОЛТАВА вул. Леніна 1/23");
            collection.Add("/331467/000112/000048/", "ТВБВ №10016/048 СТАСІ вул. Миру  40");
            collection.Add("/331467/000112/000054/", "ТВБВ №10016/054 ЖОВТНЕВЕ вул. Мічуріна 2-а");
            collection.Add("/331467/000112/000115/", "ТВБВ №10016/0115 ПОЛТАВА вул. Чураївни 1/1");
            collection.Add("/331467/000112/000116/", "ТВБВ №10016/0116 ПОЛТАВА вул. Жовтнева 6");
            collection.Add("/331467/000112/000118/", "ТВБВ №10016/0118 ПОЛТАВА вул. Фрунзе 146");
            collection.Add("/331467/000112/000119/", "ТВБВ №10016/0119 ПОЛТАВА вул. Калініна 13");
            collection.Add("/331467/000112/000121/", "ТВБВ №10016/0121 ПОЛТАВА вул. Г. Сталінграду 30");
            collection.Add("/331467/000112/000122/", "ТВБВ №10016/0122 ПОЛТАВА вул. Ціолковського 2");
            collection.Add("/331467/000112/000123/", "ТВБВ №10016/0123 ПОЛТАВА вул. Красіна 120");
            collection.Add("/331467/000112/000124/", "ТВБВ №10016/0124 ПОЛТАВА вул. Фурманова 8-а");
            collection.Add("/331467/000112/000128/", "ТВБВ №10016/0128 ПОЛТАВА вул. Халтуріна 7");
            collection.Add("/331467/000112/000130/", "ТВБВ №10016/0130 ПОЛТАВА вул. Сакко 10");
            collection.Add("/331467/000112/000131/", "ТВБВ №10016/0131 ПОЛТАВА вул. Петра Юрченка 11/2");
            collection.Add("/331467/000112/000132/", "ТВБВ №10016/0132 ПОЛТАВА вул. Пролетарська 4");
            collection.Add("/331467/000112/000134/", "ТВБВ №10016/0134 ПОЛТАВА вул. Шведська 20");
            collection.Add("/331467/000112/000136/", "ТВБВ №10016/0136 ПОЛТАВА вул. Київське Шосе 41");
            collection.Add("/331467/000112/000141/", "ТВБВ №10016/0141 ПОЛТАВА вул. Шевченка 7");
            collection.Add("/331467/000112/000144/", "ТВБВ №10016/0144 РОЗСОШЕНЦІ вул. Шевченка 15");
            collection.Add("/331467/000112/000145/", "ТВБВ №10016/0145 ТЕРЕШКИ вул. Шевченка 3");
            collection.Add("/331467/000112/060112/", "ТВБВ №10016/0112 ОПЧ ПОЛТАВА вул. Леніна 1/23");
            collection.Add("/331467/000114/", "ТВБВ №10016/0114 ПОЛТАВА вул. Європейська 63");
            collection.Add("/331467/000114/060114/", "ТВБВ №10016/0114 ОПЧ ПОЛТАВА вул. Європейська 63");
            collection.Add("/331467/000117/", "ТВБВ №10016/0117 ПОЛТАВА вул. Фрунзе 38/2");
            collection.Add("/331467/000117/060117/", "ТВБВ №10016/0117 ОПЧ ПОЛТАВА вул. Фрунзе 38/2");
            collection.Add("/331467/000120/", "ТВБВ №10016/0120 ПОЛТАВА вул. Калініна 49");
            collection.Add("/331467/000120/060120/", "ТВБВ №10016/0120 ОПЧ ПОЛТАВА вул. Калініна 49");
            collection.Add("/331467/000125/", "ТВБВ №10016/0125 НОВІ САНЖАРИ вул. Жовтнева 29");
            collection.Add("/331467/000125/060125/", "ТВБВ №10016/0125 ОПЧ НОВІ САНЖАРИ вул. Жовтнева 29");
            collection.Add("/331467/000129/", "ТВБВ №10016/0129 ПОЛТАВА вул. Гоголя, 19");
            collection.Add("/331467/000129/060129/", "ТВБВ №10016/0129 ОПЧ ПОЛТАВА вул. Гоголя, 19");
            collection.Add("/331467/000133/", "ТВБВ №10016/0133 ПОЛТАВА вул. Гагаріна 5");
            collection.Add("/331467/000133/060133/", "ТВБВ №10016/0133 ОПЧ ПОЛТАВА вул. Гагаріна 5");
            collection.Add("/331467/000135/", "ТВБВ №10016/0135 ПОЛТАВА вул. Сінна 8");
            collection.Add("/331467/000135/060135/", "ТВБВ №10016/0135 ОПЧ ПОЛТАВА вул. Сінна 8");
            collection.Add("/331467/000138/", "ТВБВ №10016/0138 ПОЛТАВА вул. Б.Хмельницького 28");
            collection.Add("/331467/000138/060138/", "ТВБВ №10016/0138 ОПЧ ПОЛТАВА вул. Б.Хмельницького 28");
            collection.Add("/331467/000139/", "ТВБВ №10016/0139 ПОЛТАВА вул. Великотирновська 39/91");
            collection.Add("/331467/000139/060139/", "ТВБВ №10016/0139 ОПЧ ПОЛТАВА вул. Великотирновська 39/91");
            collection.Add("/331467/000140/", "ТВБВ №10016/0140 ПОЛТАВА вул. Маршала Бірюзова 47б");
            collection.Add("/331467/000140/060140/", "ТВБВ №10016/0140 ОПЧ ПОЛТАВА вул. Маршала Бірюзова 47б");
            collection.Add("/331467/000146/", "ТВБВ №10016/0146 ЛОХВИЦЯ вул. Леніна 28");
            collection.Add("/331467/000146/060146/", "ТВБВ №10016/0146 ОПЧ ЛОХВИЦЯ вул. Леніна 28");
            collection.Add("/331467/000157/", "ТВБВ №10016/0157 МИРГОРОД вул. Гоголя 88");
            collection.Add("/331467/000157/000043/", "ТВБВ №10016/043 ГОГОЛЕВЕ вул. С.Горєва  30");
            collection.Add("/331467/000157/000158/", "ТВБВ №10016/0158 МИРГОРОД вул. Гоголя 96/9");
            collection.Add("/331467/000157/000159/", "ТВБВ №10016/0159 РОМОДАН вул. Шевченка 14");
            collection.Add("/331467/000157/000161/", "ТВБВ №10016/0161 ВЕЛИКІ СОРОЧИНЦІ пл. Леніна 8");
            collection.Add("/331467/000157/000164/", "ТВБВ №10016/0164 МИРГОРОД вул. Багачанська 48");
            collection.Add("/331467/000157/000168/", "ТВБВ №10016/0168 МИРГОРОД вул. Гоголя 112");
            collection.Add("/331467/000157/000170/", "ТВБВ №10016/0170 МИРГОРОД вул. Воскресінська 6");
            collection.Add("/331467/000157/000190/", "ТВБВ №10016/0190 ЯРЕСЬКИ вул. Леніна 44");
            collection.Add("/331467/000157/000192/", "ТВБВ №10016/0192 САГАЙДАК вул. Федоренка 33-А");
            collection.Add("/331467/000157/060157/", "ТВБВ №10016/0157 ОПЧ МИРГОРОД вул. Гоголя 88");
            collection.Add("/331467/000171/", "ТВБВ №10016/0171 ГАДЯЧ площа 50 років Жовтня 12, пр. 5");
            collection.Add("/331467/000171/000107/", "ТВБВ №10016/0107 ОПІШНЯ вул. Жовтнева 14");
            collection.Add("/331467/000171/000149/", "ТВБВ №10016/0149 ЧЕРВОНОЗАВОДСЬКЕ вул. Матросова 12");
            collection.Add("/331467/000171/000152/", "ТВБВ №10016/0152 СЕНЧА вул. Першотравнева 4");
            collection.Add("/331467/000171/000153/", "ТВБВ №10016/0153 ВИРІШАЛЬНЕ вул. Жовтнева 38");
            collection.Add("/331467/000171/000172/", "ТВБВ №10016/0172 ЛЮТЕНЬКА вул. Дружби 52");
            collection.Add("/331467/000171/000179/", "ТВБВ №10016/0179 ПЕТРІВКА-РОМЕНСЬКА вул. Леніна 6");
            collection.Add("/331467/000171/000187/", "ТВБВ №10016/0187 ГАДЯЧ площа 50 років Жовтня 109");
            collection.Add("/331467/000171/060171/", "ТВБВ №10016/0171 ОПЧ ГАДЯЧ площа 50 років Жовтня 12, пр. 5");
            collection.Add("/331467/000189/", "ТВБВ №10016/0189 ШИШАКИ вул. Леніна 67/2");
            collection.Add("/331467/000189/060189/", "ТВБВ №10016/0189 ОПЧ ШИШАКИ вул. Леніна 67/2");
            collection.Add("/331467/000200/", "ТВБВ №10016/0200 КРЕМЕНЧУК вул. Пролетарська 27");
            collection.Add("/331467/000200/000071/", "ТВБВ №10016/071 ДМИТРІВКА вул. Піонерська  51");
            collection.Add("/331467/000200/000074/", "ТВБВ №10016/074 БІЛИКИ вул. Миру 2-а");
            collection.Add("/331467/000200/000077/", "ТВБВ №10016/077 ОЗЕРА вул. Миру  32");
            collection.Add("/331467/000200/000092/", "ТВБВ №10016/092 КРЕМЕНЧУК вул. Київська 66-Г");
            collection.Add("/331467/000200/000201/", "ТВБВ №10016/0201 КРЕМЕНЧУК вул. Приходька 91");
            collection.Add("/331467/000200/000202/", "ТВБВ №10016/0202 КРЕМЕНЧУК вул. 60-річчя Жовтня 132/2");
            collection.Add("/331467/000200/000203/", "ТВБВ №10016/0203 КРЕМЕНЧУК вул. 60-річчя Жовтня 18");
            collection.Add("/331467/000200/000205/", "ТВБВ №10016/0205 КРЕМЕНЧУК бульвар Пушкіна буд. 15");
            collection.Add("/331467/000200/000206/", "ТВБВ №10016/0206 КРЕМЕНЧУК вул. Червоноармійська 50");
            collection.Add("/331467/000200/000209/", "ТВБВ №10016/0209 КРЕМЕНЧУК вул. 60-річчя Жовтня 80");
            collection.Add("/331467/000200/000210/", "ТВБВ №10016/0210 КРЕМЕНЧУК вул. Ернста Тельмана 26");
            collection.Add("/331467/000200/000211/", "ТВБВ №10016/0211 КРЕМЕНЧУК квт. 274, буд. 3");
            collection.Add("/331467/000200/000212/", "ТВБВ №10016/0212 КРЕМЕНЧУК вул. Київська 63");
            collection.Add("/331467/000200/000213/", "ТВБВ №10016/0213 КРЕМЕНЧУК проспект 50-річчя Жовтня 39");
            collection.Add("/331467/000200/000215/", "ТВБВ №10016/0215 КРЕМЕНЧУК вул. генерала Манагарова 1");
            collection.Add("/331467/000200/000217/", "ТВБВ №10016/0217 ОМЕЛЬНИК вул. Леніна 66");
            collection.Add("/331467/000200/000225/", "ТВБВ №10016/0225 КРЕМЕНЧУК вул. 50 років СРСР 17");
            collection.Add("/331467/000200/060200/", "ТВБВ №10016/0200 ОПЧ КРЕМЕНЧУК вул. Пролетарська 27");
            collection.Add("/331467/000204/", "ТВБВ №10016/0204 КРЕМЕНЧУК вул. Радянська буд. 24");
            collection.Add("/331467/000204/060204/", "ТВБВ №10016/0204 ОПЧ КРЕМЕНЧУК вул. Радянська буд. 24");
            collection.Add("/331467/000207/", "ТВБВ №10016/0207 КРЕМЕНЧУК вул. Першотравнева 40");
            collection.Add("/331467/000207/060207/", "ТВБВ №10016/0207 ОПЧ КРЕМЕНЧУК вул. Першотравнева 40");
            collection.Add("/331467/000208/", "ТВБВ №10016/0208 КРЕМЕНЧУК вул. 40-річчя Жовтня 9/77");
            collection.Add("/331467/000208/060208/", "ТВБВ №10016/0208 ОПЧ КРЕМЕНЧУК вул. 40-річчя Жовтня 9/77");
            collection.Add("/331467/000214/", "ТВБВ №10016/0214 КРЕМЕНЧУК вул. 1905 року 7");
            collection.Add("/331467/000214/060214/", "ТВБВ №10016/0214 ОПЧ КРЕМЕНЧУК вул. 1905 року 7");
            collection.Add("/331467/000216/", "ТВБВ №10016/0216 КРЕМЕНЧУК вул. Київська 24");
            collection.Add("/331467/000216/060216/", "ТВБВ №10016/0216 ОПЧ КРЕМЕНЧУК вул. Київська 24");
            collection.Add("/331467/000222/", "ТВБВ №10016/0222 КОЗЕЛЬЩИНА вул. Леніна 9");
            collection.Add("/331467/000222/060222/", "ТВБВ №10016/0222 ОПЧ КОЗЕЛЬЩИНА вул. Леніна 9");
            collection.Add("/331467/000226/", "ТВБВ №10016/0226 ЛУБНИ вул. Ярослава Мудрого 47-а");
            collection.Add("/331467/000226/000227/", "ТВБВ №10016/0227 ЛУБНИ пл. Вокзальна 7");
            collection.Add("/331467/000226/000231/", "ТВБВ №10016/0231 ЛУБНИ вул. Радянська 93");
            collection.Add("/331467/000226/000234/", "ТВБВ №10016/0234 ЛУБНИ вул. Першотравнева 14");
            collection.Add("/331467/000226/000236/", "ТВБВ №10016/0236 ЧОРНУХИ вул. Леніна 35");
            collection.Add("/331467/000226/000237/", "ТВБВ №10016/0237 ОРЖИЦЯ вул. Леніна 15");
            collection.Add("/331467/000226/060226/", "ТВБВ №10016/0226 ОПЧ ЛУБНИ вул. Ярослава Мудрого  47-а");

            if (context.Branches.Count() < collection.Count())
            {
                foreach (var item in collection)
                {
                    Branch branch = new Branch
                    {
                        BranchNumber = item.Key,
                        BranchAddress = item.Value
                    };
                    context.Branches.Add(branch);
                }
                context.SaveChanges();
            }  
        }

        public static Dictionary<string, string> collection = new Dictionary<string, string>();


        public static async Task InitilizeRole(IServiceProvider serviceProvider)
        {
            UserManager<ApplicationUsers> userManager = serviceProvider.GetRequiredService<UserManager<ApplicationUsers>>();
            RoleManager<IdentityRole> roleManager = serviceProvider.GetRequiredService<RoleManager<IdentityRole>>();

            string login = "adminadm";
            string pass = "Asdf!234";
            if (await roleManager.FindByIdAsync("admin") == null)
            {
                await roleManager.CreateAsync(new IdentityRole("admin"));
            }
            if (await roleManager.FindByIdAsync("user") == null)
            {
                await roleManager.CreateAsync(new IdentityRole("user"));
            }
            if (await userManager.FindByNameAsync(login) == null)
            {
                ApplicationUsers admin = new ApplicationUsers
                {
                    UserName = login
                };
                IdentityResult result = await userManager.CreateAsync(admin, pass);
                if (result.Succeeded)
                {
                    await userManager.AddToRoleAsync(admin, "admin");
                }
            }
        }
        
    }
}
